In [1]:
import pandas as pd

In [2]:
Weather=pd.read_csv(r"D:\Learning\iBridge 360\Pandas\weather_by_cities.csv")
Weather

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [3]:
Weather['temperature'].max()

92

In [6]:
#Max Temp
Weather[Weather['temperature']==Weather['temperature'].max()]

        day    city  temperature  windspeed event
7  1/4/2017  mumbai           92          5  Rain

In [7]:
#Max Temp of Paris
Weather[Weather['city']=='paris'].max()

day            1/4/2017
city              paris
temperature          54
windspeed            20
event             Sunny
dtype: object

In [9]:
#Min Temp of New York
Weather[Weather['city']=='new york'].min()

day            1/1/2017
city           new york
temperature          28
windspeed             6
event              Rain
dtype: object

In [15]:
gb=Weather.groupby("city")
gb

In [26]:
for i, n in gb:
    print('city = ',i)
    print('data = ',n)

city =  mumbai
data =          day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
city =  new york
data =          day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
city =  paris
data =           day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [17]:
gb.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [28]:
paris = gb.get_group('paris')
paris

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [29]:
mumbai = gb.get_group('mumbai')
mumbai

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [31]:
new_york = gb.get_group('new york')
new_york

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [32]:
paris.to_csv("paris.csv")